---
kind: method
id: M:Autodesk.Revit.DB.AnnotationSymbol.GetLeaders
source: html/2819f7b4-0c4b-35ed-2ca3-5221bd53fa2d.htm
---
# Autodesk.Revit.DB.AnnotationSymbol.GetLeaders Method

Returns a collection of leaders currently attached to the annotation.

## Syntax (C#)
```csharp
public IList<Leader> GetLeaders()
```

## Remarks
This method supersedes an older Leaders property which has been deprecated.